fun main() {
    /*1. Создать класс Registration с полями email и password. Для этого свойства email
написать геттер, который возвращает значение этого поля в верхнем регистре.
Для поля password написать сеттер, который контролирует, чтобы длина пароля была
не менее 6 символов, иначе выводит сообщение, что не соответствует его длина.*/
    print("1.\t")
    val reg = Registration()
    reg.setPassword()
    reg.getEmail()
}

/*2. Написать функцию поиска четных чисел двумерного массива размерностью 4 х 4.
3. Написать функцию заполнения двумерного массива 4 х 4 числами от 1 до 16 включительно.
4. Написать функцию вывода в консоль положительных элементов массива. Проверка на положительность числа выполняется локальной функцией внутри вышеуказанной.*/
