fun main() {

}

/*1. Создать класс Box(коробка), у которого есть свойства width, height, depth.
Написать функцию вычисления объёма коробки в классе Box. В классе с функцией main
создать экземпляр класса Box, в конструктор класса передать свойства,
задать им значения, вызвать функцию вычисления объема и вывести его на экран.*/

//2. Дан набор из N чисел. Найти минимальный и максимальный из элементов данного набора и вывести их.

//3. Дан массив целых чисел 3, 67, 1, 55, 65, 89, 23. Вывести на экран элементы массива.

/*4. Дано целое число. Вывести его строку-описание вида «отрицательное четное число»,
«отрицательное нечетное число» «нулевое число», «положительное нечетное число»,
«положительное четное число». int a = 34 à «положительное четное число»*/

/*5. Создайте класс Car. В классе есть конструктор с параметрами массы, скорости.
В классе с функцией main создайте экземпляр этого класса и задайте там параметры в конструктор.
Напишите функции движения и остановки автомобиля.*/